[{"title": "Full Stack Developer - Laravel React", "description": "About the job\nOn site in Alexandria Salary starts from 15K.\nFaculty of Engineering or Computer Science ONLY.\nMust be graduated with defined military status.\n\nCompany Description\nSonamak is a leading software company in the middle east specializing in Hi-tech white label software solutions. Our flagship product, Sonamak App, is a market-leading Medical Institutions Management App.\n\nJob Description\nWe are looking for a highly skilled Laravel / React Developer who is comfortable with both front and back end programming.\nFull Stack Developers are responsible for developing and designing front end web architecture, ensuring the responsiveness of applications and working alongside graphic designers for web design features, among other duties.\nFull Stack Developers will be required to see out a project from conception to final product, requiring good organizational skills and attention to detail.\n\nFull Stack Developer Responsibilities:\nDeveloping front end website architecture.\nDesigning user interactions on web pages.\nDeveloping back end website applications.\nCreating servers and databases for functionality.\nEnsuring cross-platform optimization for mobile phones.\nEnsuring responsiveness of applications.\nWorking alongside graphic designers for web design features.\nSeeing through a project from conception to finished product.\nDesigning and developing APIs.\nMeeting both technical and consumer needs.\nStaying abreast of developments in web applications and programming languages.\n\nJob Requirements\nBS/MS degree in Computer Science, Engineering, or a related subject\nObject Oriented analysis and design using common design patterns.\nExcellent in PHP - Laravel and React JS.\nCompleted Military Service\nLive inside Alexandria"}, {"title": "Senior Fullstack Engineer - React/Node.js", "description": "About the job\nCompany Overview\nKemet Trading provides institutional-grade infrastructure for digital asset derivatives trading; optimizing access to liquidity, data, trade execution and post-trade workflows.\nKemet is backed by some of the biggest names in digital asset trading and VCs in addition to a host of some of the best angels in the industry.\n\nRole Overview\nKemet is looking for a product-minded senior fullstack engineer with focus on frontend to help the team build our crypto-derivatives trading platform. You will work with software engineers, leadership, product managers, and other engineering team members to design and implement frontend components in React, backend Node.js API, as well as coach full stack engineering on frontend best practices. You must have a passion for designing and building complex performant frontends and writing production quality code.\n\nEssential Job Functions\nWork with product managers and UX designers to understand desired software features, customer interactions, and system usability requirements\nBuild complex web frontends with an emphasis on performance, scalability, security, and high-availability. including building React frontend components in TypeScript, and backend Node.js API.\nEstablish and continuously improve Kemet’s frontend coding standards for style, maintainability, and best practices for a high-scale web environment.\nWriting unit and integration tests\nPerforming code reviews, design reviews, and writing documentation.\nContainerize their code and deploy containers to Kemet’s production and non-production environments using CI/CD pipelines.\n\nMinimum Qualifications\n8 years of experience in frontend development.\nStrong object oriented design and development skills in TypeScript or, JavaScript\nExpert knowledge in front-end development and building Single Page Apps using React.js, and backend APIs using Node.js.\nExpert knowledge in MongoDB and mongoose. \nStrong knowledge in frontend design and development best practices, and state of the art web and mobile technologies. Advocate for and coach full-stack engineers on these practices.\nExperience working on an Agile team, writing clean code and utilizing pair programming, TDD, continuous integration and code reviews.\nUnit testing experience is a must, TDD is a plus (Jest, Jasmin, etc.)\n\nNice to have\nBS degree in Information Systems or Computer Science or a related technical discipline, or equivalent practical experience.\n10+ years of experience in frontend development.\nExperience working with building visualizations and dashboards using technologies similar to D3.js or Echarts.\nExperience in CI/CD (Git, Gitlab, Jenkins, Containers), knowledge in other DevOps practices is desirable (IaC, Terraform, Cloud Formation).\nExperience with AWS or other cloud service providers.\nExperience designing and building large scale distributed Microservices architecture based on 12-factor app guidance. Cloud-native, Serverless architectures experience is highly desirable.\nExperience using tools like Jira, GitLab.\n\nBenefits\nCompetitive Compensation Package\nUnlimited PTO: Unlimited vacation policy for strong, fully charged batteries.\nRemote work and flexible hours\n\nLocation - Remote Egypt"}, {"title": "Frontend Developer", "description": "About the job\nJob Title: Frontend Developer\nDepartment: Engineering\nLocation: Remote\nReports To: CTO\nContract Details\nThis is a 3-month contract position, with the possibility of extension based on performance and project needs.\n\nSummary\nWe are seeking a skilled and motivated Frontend Developer to join our team. As a Frontend Developer, you will be responsible for creating visually appealing and user-friendly web applications. You will work closely with designers, product managers, and backend developers to implement intuitive user interfaces and ensure a seamless user experience.\n\nResponsibilities\nDevelop and maintain responsive web applications using modern frontend technologies.\nConvert Figma and PSD designs into interactive web pages, ensuring pixel-perfect implementation.\nTranslate UI/UX design wireframes into high-quality code.\nCollaborate with backend developers to integrate APIs and ensure data consistency.\nOptimize frontend performance for speed and scalability.\nWrite clean, maintainable, and well-documented code.\nStay up-to-date with the latest frontend trends and technologies.\n\nQualifications\nBachelor's degree in Computer Science or a related field, or equivalent experience.\nDemonstrated ability to convert Figma and PSD designs into interactive web pages.\nStrong understanding of HTML5, CSS3, and JavaScript.\nExperience with frontend build tools.\nFamiliarity with RESTful APIs and data fetching techniques.\nExperience with version control systems.\n\nPreferred Qualifications\nExperience with state management libraries.\nExperience with accessibility best practices.\n\nBenefits\nOpportunity to work on challenging and impactful projects.\nCollaborative and supportive team environment.\nFlexible work arrangements."}, {"title": "Senior Frontend Developer", "description": "About the job\nAre you a “Sr. Frontend Developer” Looking for a unique challenge? Unleash your protentional by joining one of the biggest companies in the Middle East.\n \nJob Summary: \nResponsible for implementing visual and interactive elements that users engage with through their web browser when using a web application.\n\nJob Duties:\n\nBuild reusable code and libraries\nDesign and construct robust, scalable, and high-performance frontend solutions with an emphasis on architectural integrity, ensuring efficient handling of data and optimal responsiveness\nVerify the practical implementation and technical viability of UI/UX designs, ensuring alignment with development capabilities and constraints.\nHe should exemplify proficiency in implementing industry best practices to maintain superior code quality.\nOptimize applications for maximum speed and scalability\nEnsure that all user input is validated before submitting to back-end services\nCollaborate with other team members and stakeholders\nDevelop specifications and designs for complex applications or modify/maintain existing applications\nAble to analyze and debug critical issues and help resolve them within the accepted turnaround time\nunderstanding of cross-browser compatibility issues and ways to work around such issues\n\n\nJob Requirements:\n\nBachelor’s Degree in computer science and/or engineering or equivalent.\n3+ years’ experience in JavaScript Framework (React JS + Next JS) (Redux) .\nExcellent Understanding of OOP Concepts, especially in JavaScript\nCSS compiler knowledge (E.g., Sass, LESS)\nExcellent Knowledge of JavaScript unit testing frameworks and a proven experience with TDD/TBD with one of its frameworks.\nExcellent Knowledge of, HTML 5, CSS\nExcellent Knowledge of JavaScript + type script. \n\n\nExcellent Knowledge of Front-end frameworks (bootstrap, tailwind, etc.)\nExcellent English language (written, spoken, and understanding)."}, {"title": "Senior Frontend Engineer (Web)", "description": "About the job\nWe are building the next Zillow, AirBnb in the Middle East called propertysorted.com\n\nWant to join this rocket-ship as an early employee?\n\nThe Property Sorted team \n\nBehind the very best companies like Google and Airbnb are teams of talented, highly driven people, and that’s exactly the kind of team you can expect to join at Property Sorted. If you love autonomy, are naturally curious, and want to have a genuine impact within a growing company, we think you’d fit right in.\n\nOver the past months, the founding team have been busy building a web app used by everyone across Egypt to make better property decisions in seconds. Our app is loved by thousands of users and ready to scale to millions. Over the next 12 months, the focus is to have PropertySorted in everyone's pocket. That’s very difficult. This is where you come in - you'll help shape our apps and really leave your mark; making the real estate industry a better place for everyone.\n\nHere’s what you can expect to be working on as a Senior React Developer at Property Sorted: \n\nShip product at the speed of light\nWorking closely with our co-founders to build the best app for our customers\nA heavy focus on customer-first\nGetting involved in making decisions for the roadmap\nEnsuring feature requests and bugs get actioned quickly\n\nWho we're looking for: \n\nSense of ownership and responsibility towards the company\nInsane attention to details\nDebugging and researching skills\nYou have production experience with Next.js and React (6 years or more)\nBonus: Proficiency in python\n\nWhat you will get:\n\nAttractive cash compensation + High Equity\nHybrid work\nLearning and development at the speed of light\nBuild a product and see it affecting millions\n\nIf you’re excited by this role, we encourage you to apply.\n\nQualifications\nAbility to collaborate effectively with cross-functional teams\nStrong problem-solving and analytical skills\nExperience with agile development methodologies\nExcellent communication and teamwork abilities\nBachelor's degree in Computer Science, Software Engineering, or related field"}, {"title": "Front-end Developer (React)", "description": "About the job\nCompany Description\nAIMEDREV is a pioneering healthcare tech startup with a mission to redefine the healthcare experience for physicians through the transformative power of AI. We are dedicated to enhancing the capabilities of physicians and elevating patient care.\n\nRole Description\nThis is a remote contract role for a Front-end Developer (React). The Front-end Developer will be responsible for day-to-day tasks associated with front-end development, including building and maintaining web applications using React, implementing responsive web design, and collaborating with the back-end development team.\n\nQualifications\nFront-End Development and Responsive Web Design.\nStrong proficiency in HTML, CSS, and JavaScript\n2-3 years of experience with React and related libraries/frameworks\nAn eye for design and attention to detail.\n\nWhat We Offer:\nTask-based contracts: Flexibility to work on a per-task basis.\nFlexibility of remote work.\nCompetitive compensation: Get paid per task completed.\nExciting project: Help us bring our innovative web app to mobile platforms.\nCollaborative environment: Work with a passionate and dedicated team."}, {"title": "Frontend Developer", "description": "About the job\nWe are hiring: Frontend Developer\nAITSP is a leading software development company committed to delivering top-notch digital solutions. We are looking for a skilled Frontend Developer to join our team and help us build amazing user interfaces for our cutting-edge applications.\n\nPosition: Frontend Developer.\n\nLocation: [Qena. Nag hammady] "}, {"title": "ETIC, Front-end SW Engineer (Web/Cross Platform) - Senior Associate", "description": "About the job\nWe are hiring: Frontend Developer\nAITSP is a leading software development company committed to delivering top-notch digital solutions. We are looking for a skilled Frontend Developer to join our team and help us build amazing user interfaces for our cutting-edge applications.\n\nPosition: Frontend Developer.\n\nLocation: [Qena. Nag hammady] "}]